"""
Умножение матриц 🌶️
Напишите программу, которая перемножает две матрицы.

Формат входных данных
На вход программе подаются два натуральных числа nn и mm — количество строк и столбцов
в первой матрице, затем элементы первой матрицы, затем пустая строка. Далее следуют
числа mm и kk — количество строк и столбцов второй матрицы затем элементы второй матрицы.

Формат выходных данных
Программа должна вывести результирующую матрицу, разделяя элементы символом пробела.
"""


n, m = map(int, input().split())
a = [[int(e) for e in input().split()] for _ in range(n)]
input()
_, k = map(int, input().split())
b = [[int(u) for u in input().split()] for _ in range(m)]
c = [[0] * k for _ in range(n)]

for i in range(n):
    for j in range(k):
        for p in range(m):
            c[i][j] += a[i][p] * b[p][j]
    print(*c[i])
