d = {
    2000: 'Дракон',
    2001: 'Змея',
    2002: 'Лошадь',
    2003: 'Овца',
    2004: 'Обезьяна',
    2005: 'Петух',
    2006: 'Собака',
    2007: 'Свинья',
    2008: 'Крыса',
    2009: 'Бык',
    2010: 'Тигр',
    2011: 'Заяц'
}

# # Вариант решения из комментариев:
# # копируем таблицу из условия задачи в мультистроку.
# data = '''
# 20002000	Дракон
# 20012001	Змея
# 20022002	Лошадь
# 20032003	Овца
# 20042004	Обезьяна
# 20052005	Петух
# 20062006	Собака
# 20072007	Свинья
# 20082008	Крыса
# 20092009	Бык
# 20102010	Тигр
# 20112011	Заяц
# '''
#
# d = {int(k[:4]): v for k, v in (i.split() for i in data.strip().split('\n'))}


year = int(input())

if year not in d:
    while year < 2000:
        year += 12
    while year > 2011:
        year -= 12
print(d[year])
