"""
Покупки в интернет-магазине 🌶️
Напишите программу для подсчета количества единиц каждого вида товара
из приобретенных каждым покупателем интернет-магазина.

Формат входных данных
На вход программе подается число nn — количество строк в базе данных
о продажах интернет-магазина. Далее следует nn строк с записями вида
покупатель товар количество, где покупатель — имя покупателя (строка
без пробелов), товар — название товара (строка без пробелов),
количество — количество приобретенных единиц товара (натуральное число).

Формат выходных данных
Программа должна вывести список всех покупателей в лексикографическом
порядке, после имени каждого покупателя — двоеточие, затем список названий
всех приобретенных им товаров в лексикографическом порядке, после названия
каждого товара — количество единиц товара. Информация о каждом
товаре выводится на отдельной строке.

Примечание. Обратите внимание на второй тест. Если позиции товаров повторяются,
то в итоговый список попадает суммарное количество товара по данной позиции.

Sample Input 2:
7
Вячеслав Ручка 1
Филипп Ручка 1
Виктория Перо 3
Вячеслав Линейка 4
Виктория Тетрадь 7
Вячеслав Ручка 29
Филипп Циркуль 1

Sample Output 2:
Виктория:
Перо 3
Тетрадь 7
Вячеслав:
Линейка 4
Ручка 30
Филипп:
Ручка 1
Циркуль 1
"""


d = {}

for _ in range(int(input())):
    k1, k2, v = input().split()
    d[k1] = d.get(k1, dict())
    d[k1][k2] = d[k1].get(k2, 0) + int(v)

for i in sorted(d):
    print(f'{i}:')
    for e in sorted(d[i]):
        print(e, d[i][e])
